Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: I can see it for what it is now thanks to you.
es_419: Ahora, gracias a ti, me doy cuenta de cómo es.

source: wow…
es_419: Guau…

source: beep
es_419: BIP

source: I need to get out of here.
es_419: Me tengo que ir de aquí.

source: do we have to do this?
es_419: ¿Es necesario?

source: step
es_419: PAC

source: I'm not the kind of person you think I am!
es_419: ¡No soy la clase de persona que se imagina!

source: I'll take 3,000 won* worth, please.
es_419: Deme por 3000 wones*, por favor.

source: awkWARD
es_419: INCÓMODO

source: tumble
es_419: pum

source: whew.
es_419: Fiu.

source: thank you.
es_419: Gracias.

source: I'm sorry that I didn't pay closer attention to you.
es_419: Perdón por no haberte prestado más atención.

source: sizzle
es_419: TSS

source: drop
es_419: PLOF

source: ms. gam?
es_419: ¿La señorita Gam?

source: I was wondering what he meant by that...
es_419: Me preguntaba a qué se refería con eso…

source: glance
es_419: MIRA

source: calm down there, heart.
es_419: Cálmate, corazón.

source: are you okay? you look nervous.
es_419: ¿Estás bien? Pareces nerviosa.

source: convenience store
es_419: TIENDA

source: I'm sorry, something urgent has come up…
es_419: Lo siento, surgió algo urgente…

source: I'm sorry?
es_419: ¿Perdón?

source: yes, sir.
es_419: Sí, señor.

source: drip
es_419: plic

source: during work. will take
es_419: el trabajo. Tardará cuatro

source: Our companies are partners.
es_419: Tenemos empresas asociadas.

source: you don't know my name, do you?
es_419: No sabes cómo me llamo, ¿cierto?

source: he's the type that moms would like!
es_419: ¡Es de los que les caen bien a las madres!

source: speak of the devil...
es_419: Hablando del rey de Roma…

source: at first, I felt I didn't want to lose a competent employee.
es_419: Primero sentí que no quería perder a una empleada competente.

source: it was hard, but…
es_419: Era difícil, pero…

source: you're better than I thought, dohyeok.
es_419: Eres mejor de lo que pensé, Dohyeok.

source: I know you're busy--
es_419: Sé que está ocupado…

source: you're the one who still got it wrong after I told you a thousand times.
es_419: Eres tú el que aún no se lo aprende, aunque te lo haya dicho mil veces.

source: except for beans?
es_419: ¿Salvo guisantes?

source: let's think back…
es_419: Recapitulemos…

source: but was it because of my recent stroke of luck?
es_419: Pero ¿fue por ese golpe de suerte reciente?

source: he's… perfect.
es_419: Es… perfecto.

source: I feel like I can do anything,
es_419: Siento que puedo hacer de todo,

source: how sly of him.
es_419: Qué astuto es.

source: i-it's okay!
es_419: ¡E-está bien!

source: what the…
es_419: ¿Pero qué…?

source: ...completely different worlds.
es_419: … de mundos totalmente distintos.

source: I think I've caused a big misunderstanding...
es_419: Creo que generé una tremenda confusión…

source: ...but I guess he knew how hard I worked my butt off for him.
es_419: … pero parece que sabía cuánto me rompía el lomo por él.

source: so…
es_419: Y…

source: ha…
es_419: Ja…

source: korean language
es_419: Idioma coreano

source: you failed. no, you're disqualified.
es_419: Desaprobado. No, descalificado.

source: flinch
es_419: SUSTO

source: it's no good seeing her like this!
es_419: ¡No será bueno que se vean así!

source: she's right.
es_419: Tiene razón.

source: what‘s wrong now?
es_419: Ahora qué pasa?

source: but then one day, you were making a face I had never seen.
es_419: Pero un día pusiste una cara que no había visto nunca.

source: for some, it's just the night before saturday.
es_419: Para algunas personas, solo es la noche antes del sábado.

source: sounds good. how about spicy seafood noodle soup?
es_419: Me parece bien. ¿Sopa picante de fideos y mariscos?

source: awkward
es_419: INCÓMODA

source: what?!
es_419: ¡¿Qué?!

source: ow...
es_419: Ay…

source: but to regular people like me, it's what gave me the courage to quit...
es_419: Pero a mí, que soy una persona común, me dio el valor para renunciar…

source: - episode 06 -
es_419: - episodio 06 -

source: I won't tell anyone at work, so don't worry.
es_419: No se preocupe, no le diré a nadie en el trabajo.

source: don’t worry. i am good at this.
es_419: Descuida. Soy bueno para esto.

source: like I've said before, you are a very good secretary.
es_419: Ya te lo he dicho: eres muy buena secretaria.

source: have I...
es_419: ¿Me habré…

source: - episode 04 -
es_419: - episodio 04 -

source: I don't need it.
es_419: No es momento.

source: I think these shoes would look lovely on you. would you like to try them on?
es_419: Creo que estos zapatos le quedarían divinos. ¿Quiere probárselos?

source: oh, well... y-yes, sir...something similar to that.
es_419: Ah, eh… S-sí, señor… algo así.

source: I don't know why...
es_419: No sé por qué…

source: tell me. what's with the book? you don't even have a kid.
es_419: Dime. ¿Qué pasa con el libro? Ni siquiera eres padre.

source: I'm sorry!
es_419: ¡Lo siento!

source: deleted message
es_419: MENSAJE ELIMINADO

source: thump
es_419: TUM

source: he's serious about her!
es_419: ¡Va en serio con ella!

source: it's fine.
es_419: Está bien.

source: is something wrong?
es_419: ¿Ocurre algo?

source: stare
es_419: MIRA

source: sigh
es_419: Ains…

source: tuesday
es_419: martes

source: attempt 9,382 winning numbers jan.21.2021
es_419: Sorteo 9382 Números ganadores 21/01/2021

source: 1.6 billion--
es_419: 1600 millones…

source: I have to tell him today...
es_419: Le tengo que decir hoy…

source: ...if I didn't work harder than everyone else.
es_419: … si no me hubiera esforzado más que el resto.

source: what do you mean?
es_419: ¿Qué quieres decir?

source: you know, the weather's getting colder now. be careful not to catch a cold.
es_419: Ten en cuenta que está cada vez más frío. Procura no resfriarte.

source: I do know your name.
es_419: Sí sé tu nombre.

source: but don't worry. the general admin team is taking care of it.
es_419: Pero descuida. El equipo de administración general lo resolverá.

source: spill
es_419: DERRAMA

source: What? is it...
es_419: ¿Cómo? ¿Es…?

source: connecting with the child out-of-order
es_419: Comunicarse con el niño descarriado

source: excellent choice, miss.
es_419: Muy bien, señorita.

source: but…
es_419: Pero…

source: I work out regularly.
es_419: Entreno seguido.

source: hmm…
es_419: Mmm…

source: oh, come on! it's nothing special.
es_419: Pero si no es nada especial.

source: asset manager certification
es_419: Certificado: Asesor financiero

source: I don't even eat breakfast.
es_419: Ni siquiera desayuno.

source: slip
es_419: suelta

source: I'm sorry I didn't tell you sooner…
es_419: Perdón por no haberte contado antes…

source: uncle...
es_419: Tío…

source: I won the lottery.
es_419: Gané la lotería.

source: ding
es_419: DIN

source: ...I've never been in a situation like this before.
es_419: … es la primera vez que estoy en esta situación.

source: what's that in your hand?
es_419: ¿Qué tienes en la mano?

source: anyway, I came to have a drink and watch a movie with you. alone.
es_419: En fin, vine a beber algo y ver una película juntos. Solos.

source: ...may seem impressive at a glance, but many of them are extremely lonely.
es_419: … pueden resultar admirables al principio, pero en general sienten mucha soledad.

source: drag
es_419: TRRR

source: what time is it?
es_419: ¿Qué hora es?

source: wow.
es_419: Guau.

source: hahaha... well...
es_419: Ja, ja. Bueno…

source: I should've been nicer to you.
es_419: Debí haber sido más amable contigo.

source: blush
es_419: SONROJADA

source: why are you being like this now?
es_419: ¿Por qué ahora hace eso?

source: it may look like a book on raising a child,
es_419: Quizás parezca un libro para criar niños,

source: your button is open.
es_419: Se te desabrochó el botón.

source: sparkle
es_419: DESTELLO

source: Don't ever leave me even if you're disappointed by that.
es_419: No me dejes nunca, aunque te decepcione con eso.

source: w-why? well…
es_419: ¿Por… qué? Pues…

source: that somehow pisses me--
es_419: No sé por qué, me molesta…

source: I considered quitting several times a day.
es_419: Pensaba en renunciar varias veces al día.

source: I'm not married.
es_419: No estoy casado.

source: applicant
es_419: Solicitante

source: I'm not sure if you were aware, but I've never had a secretary quite like you, ms. gam.
es_419: No sé si lo sabías, pero nunca he tenido una secretaria como tú, señorita Gam.

source: I've read books and searched the internet for a way to make you stay.
es_419: Leí libros y busqué en internet una forma de evitar que te fueras.

source: I won't be in office all afternoon.
es_419: Me iré de la oficina toda la tarde.

source: if I didn't clean the house…
es_419: De no haber hecho limpieza…

source: sure. take your time.
es_419: Bueno. Sin apuro.

source: and?
es_419: ¿Y?

source: Tap
es_419: TAC

source: dohyeok's child…
es_419: Dohyeok, padre…

source: I shouldn't be saying this to a sick person.
es_419: No debería decirle esto a alguien enfermo.

source: he knew?
es_419: ¿Él sabía?

source: to be continued...
es_419: Continuará...

source: dohyeok has a girlfriend. didn't you know?
es_419: Dohyeok tiene novia. ¿No sabías?

source: I mean...
es_419: O sea…

source: did you consider that to be competence?
es_419: ¿Usted pensaba que eso era aptitud?

source: a-ha!
es_419: ¡Ajá!

source: slap
es_419: plaf

source: ...all that.
es_419: … todo eso.

source: yes, you're right.
es_419: Sí, tiene razón.

source: ...he said something along those lines.
es_419: … dijo algo de ese estilo.

source: ...don't get sick.
es_419: No te enfermes.

source: that's 1.6 billion* without tax.
es_419: Sin impuestos, son 1600 millones*.

source: I'm so sad that you're leaving soon.
es_419: Qué triste que te vayas tan pronto.

source: I'll cook for you next time.
es_419: La próxima te cocinaré yo.

source: thank you, but I can handle it alone.
es_419: Gracias, pero puedo hacerlo sola.

source: I've never been in a relationship.
es_419: Nunca he tenido una relación.

source: you must be tired from working so late. get some rest. bye.
es_419: Debes estar muy cansada de tanto trabajo. Descansa. Adiós.

source: ...and he still gets my name wrong.
es_419: … y aún no dice bien mi nombre.

source: I tried to stop her...
es_419: Intenté detenerla…

source: grab
es_419: SUJETA

source: Haha.
es_419: Ja, ja.

source: I guess I still haven't grown up.
es_419: Se ve que me falta madurar…

source: well, I am.
es_419: Pues, sí.

source: when it comes to adults, there's nothing better than alcohol.
es_419: Cuando se trata de adultos, no hay nada mejor que el alcohol.

source: yu-eun, call the police! there's a crazy guy in here!
es_419: ¡Llama a la policía, Yu-eun! ¡Hay un loco en el baño!

source: I'm sorry, but I can't hear you.
es_419: Lo siento, pero no lo oigo.

source: I'm very picky.
es_419: Soy muy exigente.

source: ...and that's when I saw...
es_419: … ahí fue cuando vi…

source: what do you do in situations like this?
es_419: ¿Qué se hace en estas situaciones?

source: launching my own business?
es_419: ¿Pongo mi propio negocio?

source: at age 28...
es_419: A los 28 años…

source: then what about...
es_419: ¿Y qué hay de…

source: saying that won't change anything...
es_419: Con decirlo no cambiará nada…

source: and… I wanted to check...
es_419: Y… quería saber…

source: well…
es_419: Pues…

source: oh, it's in the middle lower cabinet--
es_419: Ah, está abajo, en el medio…

source: should I do some cleaning?
es_419: ¿Y si limpio un poco?

source: …tell?
es_419: … supiste?

source: I...
es_419: Eh…

source: y-yes, I do!!!
es_419: ¡¡S-sí, obvio!!

source: Even if Mr. Chae did all this for me...
es_419: Aunque el señor Chae lo haya hecho por mí…

source: w-what do you mean?
es_419: ¿Qué… quieres decir?

source: there he goes again...
es_419: Ya empezó de nuevo…

source: treating employees like a nobody...
es_419: Trata al personal como basura…

source: anything expensive will do.
es_419: Cualquier cosa cara bastará.

source: I should be busy building my career.
es_419: Debería forjarme una carrera.

source: drinks? ha!
es_419: ¿Tragos? ¡Ja!

source: sir!
es_419: ¡Señor!

source: it's just so annoying...
es_419: Pero es tan molesto…

source: oh…
es_419: Ah…

source: oh no…
es_419: Ay, no…

source: r-right!
es_419: ¡C-cierto!

source: wow, I must have been so drunk, I couldn't even get a taxi.
es_419: Guau, parece que estaba tan ebria que no podía pedir un taxi.

source: what a nightmare...
es_419: Qué pesadilla…

source: I thought it would be over for me if I followed the current.
es_419: Creía que, si seguía la corriente, esta acabaría conmigo.

source: thud
es_419: PUM

source: you know, that's borderline obsession.
es_419: Te cuento que eso es casi una obsesión.

source: you're so nice to me now!
es_419: ¡Ahora eres muy amable!

source: what time did you sleep?
es_419: ¿A qué hora te acostaste?

source: …like you.
es_419: … me gustas.

source: um…
es_419: Eh…

source: I refuse to live…
es_419: Me rehúso a que…

source: ...and became a big part of who I was.
es_419: … y terminaron siendo gran parte de mí.

source: I'll have the extra-large bowl.
es_419: Pediré el plato extragrande.

source: haha…
es_419: Jaja…

source: haha.
es_419: Ja, ja.

source: I thought that was why ms. gam was resigning.
es_419: Creí que por eso renunciaba la señorita Gam.

source: - episode 21 -
es_419: - episodio 21 -

source: w-why?
es_419: ¿Por… qué?

source: I won 2.4 billion won*
es_419: Gané 2400 millones de wones*.

source: fidget
es_419: INQUIETA

source: Oh, it's the people from HR.
es_419: Ah, es la gente de RR. HH.

source: I see.
es_419: Ya veo.

source: - episode 19 -
es_419: - episodio 19 -

source: hello.
es_419: Hola.

source: jiwoo said it's my reward for living like a saint.
es_419: Jiwoo dijo que es mi recompensa por vivir como una santa.

source: yes. there are some confidential matters...
es_419: Sí. Hay unos asuntos confidenciales…

source: that was when you were in iren.
es_419: eso era cuando estabas en IREN.

source: what are you doing?
es_419: ¿Qué estás haciendo?

source: I came as soon as I heard.
es_419: Vine apenas me enteré.

source: he's been fine recently. why today of all days?
es_419: Últimamente ha estado bien. ¿Por qué justo hoy?

source: nod
es_419: ASIENTE

source: please don't get me wrong.
es_419: No me malinterpretes.

source: blech
es_419: BLERJ

source: no. snap out of it!
es_419: No. ¡Espabílate!

source: what about her? she seems fine to me.
es_419: ¿Qué tiene? Yo la vi bien.

source: language exam
es_419: Examen de idioma

source: there's a lot more I want to ask you.
es_419: Quiero saber muchas cosas más.

source: see?
es_419: ¿Ven?

source: ...so I wanted to do something for you.
es_419: … así que quise hacer algo por ti.

source: chicken
es_419: COBARDE

source: I think this is more than enough!
es_419: ¡Creo que es más que suficiente!

source: I've got no place to go--
es_419: No tengo a dónde ir…

source: count me in, too!
es_419: Yo también voy!

source: I'm done eating.
es_419: Ya terminé.

source: where are you rushing off to?
es_419: ¿A dónde vas tan rápido?

source: good morning.
es_419: Buen día.

source: it's freezing cold...
es_419: Está helado…

source: where is he?
es_419: ¿Dónde estará?

source: knock
es_419: TOC

source: as time went by…
es_419: Con el paso del tiempo…

source: I'm so flattered.
es_419: Me halagas.

source: tremble
es_419: TIEMBLA

source: well, I'm getting to that age where I have to think about marriage--
es_419: Pues, ya casi estoy en edad de empezar a pensar en casarme…

source: y-yes?
es_419: ¿S-sí?

source: en_US
es_419: ES_LATAM

source: dohyeok, you !$%^#@!~!@#$%!
es_419: ¡Dohyeok, pedazo de $%^~@#$!

source: now that I think about it, I haven't been working late these past few days...
es_419: Ahora que lo pienso, hace ya varios días que no me quedo hasta tarde…

source: don't say that, you should be proud of yourself!
es_419: No digas eso, ¡deberías sentirte orgullosa!

source: whoosh
es_419: FUUUSH

source: in that sense... you'll do great wherever you go, whenever you go.
es_419: En ese sentido… Te irá bien, vayas donde vayas, cuando lo hagas.

source: as you can see, since it takes a lot of work…
es_419: Como ves, es muy trabajoso…

source: I think it was gam or something.
es_419: Creo que era Gam o algo así.

source: come here.
es_419: Ven.

source: take it easy for a while.
es_419: Tómatelo con calma.

source: ...it was pretty good.
es_419: Estuvo muy buena.

source: oh, I see.
es_419: Ah, entiendo.

source: j-jiwoo! hold on!
es_419: ¡E-espera, Jiwoo!

source: sorry. tmi.
es_419: Demasiada información.

source: sorry, let me take this.
es_419: Perdón, debo contestar.

source: what, dohyeok?
es_419: ¿Quién, Dohyeok?

source: your numbers
es_419: sus números

source: oww…
es_419: Aaay…

source: d a s h
es_419: h u y e

source: dude, you've got to get rid of that parenting book.
es_419: Hermano, deja de leer ese libro sobre crianza.

source: Thanks for your hard work.
es_419: Gracias por esforzarte.

source: yikes
es_419: AIA

source: perhaps this means...
es_419: ¿Significará que…

source: bam
es_419: BUM

source: sure, I know a good place... but why?
es_419: Sí, conozco un lugar bueno… Para qué?

source: exhausted
es_419: exhausta

source: yes.
es_419: Sí.

source: hyorin, you're going to pay for this!
es_419: ¡Hyorin, me las vas a pagar!

source: want some coffee?
es_419: Quiere café?

source: slide
es_419: se acerca

source: I was the one... who couldn't keep up.
es_419: Soy yo… quien no estuvo a la altura.

source: I do have to move soon…
es_419: Me mudaré pronto…

source: I did think about opening a coffee shop, but I don’t know where to start.
es_419: Se me ocurrió abrir un café, pero no sabría por dónde empezar.

source: wow. congrats for now.
es_419: guau. te felicito.

source: I was hoping she'd stay a bit longer today...
es_419: Me habría gustado que se quedara más tiempo hoy…

source: snap out of it, yu-eun. this is no time to fantasize.
es_419: Déjate de boberías, Yu-eun. No es momento de fantasear.

source: y-you're rejecting it?
es_419: ¿L-la rechaza?

source: I've visited the police so many times to try and catch the hit-and-run driver.
es_419: Fui a la comisaría incontables veces para tratar de atrapar al que causó el accidente.

source: w o b b l e
es_419: t a m b a l e a

source: I didn't have many friends in college because I was too obsessed with grades and beefing up my resume.
es_419: En la universidad no hice muchas amistades porque me obsesioné con las notas y engrosar el currículum.

source: cough
es_419: COF

source: why are you acting so weird all of a sudden?!
es_419: ¡¿Por qué se comporta tan raro de repente?!

source: s h u d d e r
es_419: t i e m b l a

source: oh, books…
es_419: Ah, libros…

source: I never do this when I'm out!!!
es_419: ¡¡No lo hago nunca cuando salgo!!

source: oh!
es_419: Ah!

source: how to properly raise a broken child
es_419: Cómo criar a un niño descarriado

source: b o w
es_419: REVERENCIA

source: my permission?
es_419: ¿Mi permiso?

source: I'm sorry for keeping you so late.
es_419: Perdón por hacerte quedar hasta tarde.

source: ugh…
es_419: Uff…

source: mind your own business.
es_419: Métete en tus asuntos.

source: do you want me to keep calling you boss?!
es_419: ¡¿Quieres que te siga diciendo jefe?!

source: give the child some room for mistakes.
es_419: Dele la oportunidad de equivocarse.

source: huff
es_419: UFF

source: daze
es_419: ATURDIDO

source: …and my boss is out of order.
es_419: … y mi jefe está descarriado.

source: let's just stay like this for a minute.
es_419: Quedémonos así un ratito.

source: now it's time to get on with chapter three.
es_419: Es momento de avanzar al capítulo tres.

source: the doctor already treated it, so don't worry.
es_419: Ya me vio el médico, así que no te preocupes.

source: My reason has given way to my emotions.
es_419: Mis emociones sobrepasaron a la razón.

source: does it hurt?
es_419: ¿Te duele?

source: I went through a lot before I came to iren.
es_419: Pasé por muchas cosas antes de llegar a IREN.

source: good thinking on your feet, dohyeok.
es_419: Muy sensato de tu parte, Dohyeok.

source: but he's so good looking!
es_419: ¡Pero es muy apuesto!

source: haha, just look at me.
es_419: Ja, ja, mírenme no más.

source: compensation for damage
es_419: Indemnización por daños

source: brush
es_419: FRUS

source: US stocks study
es_419: Acciones de EE. UU.

source: rumble
es_419: GRUOOO

source: okay.
es_419: Bueno.

source: h-he drank it!
es_419: ¡S-se lo tomó!

source: are you all right?
es_419: ¿Estás bien?

source: I'm pathetic.
es_419: Qué patética.

source: all
es_419: todo

source: ...didn't look sick or anything.
es_419: … no parecía enferma ni nada.

source: rustle
es_419: FRUS

source: he's going to pay for this!
es_419: ¡me las va a pagar!

source: ...what was that about?
es_419: ¿Qué fue eso?

source: damn it…
es_419: Diablos…

source: you'll make yourself sick if you keep doing that.
es_419: Si sigues haciendo eso, te vas a enfermar.

source: it's nothing like that. it just... reminded me of my past, that's all.
es_419: No, para nada. Es que… me acordé de mi infancia, nada más.

source: actually, I'm impressed that you could keep up.
es_419: La verdad, me asombra que hayan seguido el ritmo.

source: dissecting the employees’ minds
es_419: Disección de la mente del personal

source: you've been in a car so many times when working with me.
es_419: Cuando trabajabas conmigo, viajaste mucho en auto.

source: e-excuse me, sir?
es_419: ¿D-disculpe, señor?

source: click
es_419: CLIC

source: I'll do it for real this time and leave.
es_419: Esta vez lo haré de verdad, me iré.

source: what is it?
es_419: ¿Qué pasa?

source: financial...
es_419: ¿Metas…

source: why do you keep calling me by my first name?
es_419: ¿Por qué me llama por mi nombre de pila?

source: hey, friend!
es_419: ¡Ey, amiga!

source: you're really good looking.
es_419: Eres muy apuesto.

source: ...but he has been taking on my work as well lately.
es_419: … pero últimamente también está haciendo mi parte.

source: it's all a bit awkward, but...
es_419: Es medio raro, pero…

source: setting a goal is key in managing finances.
es_419: Es esencial establecer una meta para sus finanzas.

source: just random things not related to work.
es_419: De cualquier cosa, nada que ver con el trabajo.

source: I‘m quitting.
es_419: Voy a renunciar.

source: awaiting your approval
es_419: PARA APROBAR

source: huh?
es_419: ¿Eh?

source: y-yes, sir.
es_419: S-sí, señor.

source: chapter three,
es_419: Capítulo tres:

source: tap
es_419: TAC

source: she was the only one there for me.
es_419: fue la única que se quedó a mi lado.

source: buzz
es_419: BZZ

source: dang it.
es_419: Rayos.

source: this isn’t what I planned.
es_419: No es lo que planeaba.

source: here.
es_419: Toma.

source: can you take mine too?
es_419: ¿Me tomas una a mí?

source: h-hello, sir!
es_419: ¡Ho-hola, señor!

source: finally debt free.
es_419: ya no tengo deudas.

source: d-don't say that. everything worked out in the end, didn't it?
es_419: N-no lo digas así. Al final todo resultó bien, ¿no crees?

source: do I feel bad? guilty? but why?!
es_419: ¿Me siento mal? ¿Culpable? ¡¿Por qué?!

source: I better go and say--
es_419: Mejor les digo que…

source: oh...
es_419: Ah…

source: what nonsense is this?
es_419: ¿Qué es este disparate?

source: ugh...
es_419: Uff…

source: it just happened?
es_419: ¿Se dio así?

source: please stay here…
es_419: No te vayas…

source: me and my wild imagination.
es_419: Yo y mi loca imaginación.

source: nothing in particular.
es_419: Nada en particular.

source: chirp
es_419: PÍO
